apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/****************************************************************************
 * arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_RTC_IO_H
#define __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_RTC_IO_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32s3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* RTCIO_RTC_GPIO_OUT_REG register
 * RTC GPIO output register
 */

#define RTCIO_RTC_GPIO_OUT_REG (DR_REG_RTCIO_BASE + 0x0)

/* RTCIO_GPIO_OUT_DATA : R/W; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output register. Bit10 corresponds to GPIO0, bit11 corre-
 * sponds to GPIO1, etc.
 */

#define RTCIO_GPIO_OUT_DATA    0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_M  (RTCIO_GPIO_OUT_DATA_V << RTCIO_GPIO_OUT_DATA_S)
#define RTCIO_GPIO_OUT_DATA_V  0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_S  10

/* RTCIO_RTC_GPIO_OUT_W1TS_REG register
 * RTC GPIO output bit set register
 */

#define RTCIO_RTC_GPIO_OUT_W1TS_REG (DR_REG_RTCIO_BASE + 0x4)

/* RTCIO_GPIO_OUT_DATA_W1TS : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output set register. If the value 1 is written to a bit here,
 * the corresponding bit in RTCIO_RTC_GPIO_OUT_REG will be set to 1.
 * Recommended operation: use this register to set RTCIO_RTC_GPIO_OUT_REG.
 */

#define RTCIO_GPIO_OUT_DATA_W1TS    0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_W1TS_M  (RTCIO_GPIO_OUT_DATA_W1TS_V << RTCIO_GPIO_OUT_DATA_W1TS_S)
#define RTCIO_GPIO_OUT_DATA_W1TS_V  0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_W1TS_S  10

/* RTCIO_RTC_GPIO_OUT_W1TC_REG register
 * RTC GPIO output bit clear register
 */

#define RTCIO_RTC_GPIO_OUT_W1TC_REG (DR_REG_RTCIO_BASE + 0x8)

/* RTCIO_GPIO_OUT_DATA_W1TC : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output clear register. If the value 1 is written to a bit
 * here, the corresponding bit in RTCIO_RTC_GPIO_OUT_REG will be cleared.
 * Recommended operation: use this register to clear RTCIO_RTC_GPIO_OUT_REG.
 */

#define RTCIO_GPIO_OUT_DATA_W1TC    0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_W1TC_M  (RTCIO_GPIO_OUT_DATA_W1TC_V << RTCIO_GPIO_OUT_DATA_W1TC_S)
#define RTCIO_GPIO_OUT_DATA_W1TC_V  0x003FFFFF
#define RTCIO_GPIO_OUT_DATA_W1TC_S  10

/* RTCIO_RTC_GPIO_ENABLE_REG register
 * RTC GPIO output enable register
 */

#define RTCIO_RTC_GPIO_ENABLE_REG (DR_REG_RTCIO_BASE + 0xc)

/* RTCIO_REG_RTCIO_REG_GPIO_ENABLE : R/W; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output enable. Bit10 corresponds to GPIO0, bit11 corresponds
 * to GPIO1, etc. If the bit is set to 1, it means this GPIO pad is output.
 */

#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE    0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_M  (RTCIO_REG_RTCIO_REG_GPIO_ENABLE_V << RTCIO_REG_RTCIO_REG_GPIO_ENABLE_S)
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_V  0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_S  10

/* RTCIO_RTC_GPIO_ENABLE_W1TS_REG register
 * RTC GPIO output enable bit set register
 */

#define RTCIO_RTC_GPIO_ENABLE_W1TS_REG (DR_REG_RTCIO_BASE + 0x10)

/* RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output enable set register. If the value 1 is written to a bit
 * here, the corresponding bit in RTCIO_RTC_GPIO_ENABLE_REG will be set to
 * 1. Recommended operation: use this register to set
 * RTCIO_RTC_GPIO_ENABLE_REG.
 */

#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS    0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS_M  (RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS_V << RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS_S)
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS_V  0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TS_S  10

/* RTCIO_RTC_GPIO_ENABLE_W1TC_REG register
 * RTC GPIO output enable bit clear register
 */

#define RTCIO_RTC_GPIO_ENABLE_W1TC_REG (DR_REG_RTCIO_BASE + 0x14)

/* RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC : WO; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 output enable clear register. If the value 1 is written to a
 * bit here, the corresponding bit in RTCIO_RTC_GPIO_ENABLE_REG will be
 * cleared. Recom- mended operation: use this register to clear
 * RTCIO_RTC_GPIO_ENABLE_REG.
 */

#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC    0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC_M  (RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC_V << RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC_S)
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC_V  0x003FFFFF
#define RTCIO_REG_RTCIO_REG_GPIO_ENABLE_W1TC_S  10

/* RTCIO_RTC_GPIO_STATUS_REG register
 * RTC GPIO interrupt status register
 */

#define RTCIO_RTC_GPIO_STATUS_REG (DR_REG_RTCIO_BASE + 0x18)

/* RTCIO_GPIO_STATUS_INT : R/W; bitpos: [31:10]; default: 0;
 * GPIO0 ~ 21 interrupt status register. Bit10 corresponds to GPIO0, bit11
 * corresponds to GPIO1, etc. This register should be used together with RT-
 * CIO_RTC_GPIO_PINn_INT_TYPE in RTCIO_RTC_GPIO_PINn_REG. 0: no interrupt;
 * 1: corresponding interrupt.
 */

#define RTCIO_GPIO_STATUS_INT    0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_M  (RTCIO_GPIO_STATUS_INT_V << RTCIO_GPIO_STATUS_INT_S)
#define RTCIO_GPIO_STATUS_INT_V  0x003FFFFF
#define RTCIO_GPIO_STATUS_INT_S  10

