apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/* RTCIO_RTC_GPIO_PIN3_REG register
 * RTC configuration for pin 3
 */

#define RTCIO_RTC_GPIO_PIN3_REG (DR_REG_RTCIO_BASE + 0x34)

/* RTCIO_GPIO_PIN3_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN3_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN3_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN3_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN3_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN3_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN3_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN3_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN3_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN3_INT_TYPE_M  (RTCIO_GPIO_PIN3_INT_TYPE_V << RTCIO_GPIO_PIN3_INT_TYPE_S)
#define RTCIO_GPIO_PIN3_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN3_INT_TYPE_S  7

/* RTCIO_GPIO_PIN3_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN3_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN3_PAD_DRIVER_M  (RTCIO_GPIO_PIN3_PAD_DRIVER_V << RTCIO_GPIO_PIN3_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN3_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN3_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN4_REG register
 * RTC configuration for pin 4
 */

#define RTCIO_RTC_GPIO_PIN4_REG (DR_REG_RTCIO_BASE + 0x38)

/* RTCIO_GPIO_PIN4_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN4_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN4_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN4_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN4_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN4_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN4_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN4_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN4_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN4_INT_TYPE_M  (RTCIO_GPIO_PIN4_INT_TYPE_V << RTCIO_GPIO_PIN4_INT_TYPE_S)
#define RTCIO_GPIO_PIN4_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN4_INT_TYPE_S  7

/* RTCIO_GPIO_PIN4_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN4_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN4_PAD_DRIVER_M  (RTCIO_GPIO_PIN4_PAD_DRIVER_V << RTCIO_GPIO_PIN4_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN4_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN4_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN5_REG register
 * RTC configuration for pin 5
 */

#define RTCIO_RTC_GPIO_PIN5_REG (DR_REG_RTCIO_BASE + 0x3c)

/* RTCIO_GPIO_PIN5_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN5_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN5_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN5_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN5_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN5_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN5_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN5_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN5_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN5_INT_TYPE_M  (RTCIO_GPIO_PIN5_INT_TYPE_V << RTCIO_GPIO_PIN5_INT_TYPE_S)
#define RTCIO_GPIO_PIN5_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN5_INT_TYPE_S  7

/* RTCIO_GPIO_PIN5_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN5_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN5_PAD_DRIVER_M  (RTCIO_GPIO_PIN5_PAD_DRIVER_V << RTCIO_GPIO_PIN5_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN5_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN5_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN6_REG register
 * RTC configuration for pin 6
 */

#define RTCIO_RTC_GPIO_PIN6_REG (DR_REG_RTCIO_BASE + 0x40)

/* RTCIO_GPIO_PIN6_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN6_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN6_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN6_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN6_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN6_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN6_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN6_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN6_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN6_INT_TYPE_M  (RTCIO_GPIO_PIN6_INT_TYPE_V << RTCIO_GPIO_PIN6_INT_TYPE_S)
#define RTCIO_GPIO_PIN6_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN6_INT_TYPE_S  7

/* RTCIO_GPIO_PIN6_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN6_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN6_PAD_DRIVER_M  (RTCIO_GPIO_PIN6_PAD_DRIVER_V << RTCIO_GPIO_PIN6_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN6_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN6_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN7_REG register
 * RTC configuration for pin 7
 */

#define RTCIO_RTC_GPIO_PIN7_REG (DR_REG_RTCIO_BASE + 0x44)

/* RTCIO_GPIO_PIN7_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN7_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN7_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN7_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN7_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN7_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN7_WAKEUP_ENABLE_S  10

