apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/* RTCIO_GPIO_PIN7_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN7_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN7_INT_TYPE_M  (RTCIO_GPIO_PIN7_INT_TYPE_V << RTCIO_GPIO_PIN7_INT_TYPE_S)
#define RTCIO_GPIO_PIN7_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN7_INT_TYPE_S  7

/* RTCIO_GPIO_PIN7_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN7_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN7_PAD_DRIVER_M  (RTCIO_GPIO_PIN7_PAD_DRIVER_V << RTCIO_GPIO_PIN7_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN7_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN7_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN8_REG register
 * RTC configuration for pin 8
 */

#define RTCIO_RTC_GPIO_PIN8_REG (DR_REG_RTCIO_BASE + 0x48)

/* RTCIO_GPIO_PIN8_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN8_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN8_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN8_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN8_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN8_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN8_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN8_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN8_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN8_INT_TYPE_M  (RTCIO_GPIO_PIN8_INT_TYPE_V << RTCIO_GPIO_PIN8_INT_TYPE_S)
#define RTCIO_GPIO_PIN8_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN8_INT_TYPE_S  7

/* RTCIO_GPIO_PIN8_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN8_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN8_PAD_DRIVER_M  (RTCIO_GPIO_PIN8_PAD_DRIVER_V << RTCIO_GPIO_PIN8_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN8_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN8_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN9_REG register
 * RTC configuration for pin 9
 */

#define RTCIO_RTC_GPIO_PIN9_REG (DR_REG_RTCIO_BASE + 0x4c)

/* RTCIO_GPIO_PIN9_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN9_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN9_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN9_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN9_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN9_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN9_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN9_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN9_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN9_INT_TYPE_M  (RTCIO_GPIO_PIN9_INT_TYPE_V << RTCIO_GPIO_PIN9_INT_TYPE_S)
#define RTCIO_GPIO_PIN9_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN9_INT_TYPE_S  7

/* RTCIO_GPIO_PIN9_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN9_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN9_PAD_DRIVER_M  (RTCIO_GPIO_PIN9_PAD_DRIVER_V << RTCIO_GPIO_PIN9_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN9_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN9_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN10_REG register
 * RTC configuration for pin 10
 */

#define RTCIO_RTC_GPIO_PIN10_REG (DR_REG_RTCIO_BASE + 0x50)

/* RTCIO_GPIO_PIN10_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN10_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN10_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN10_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN10_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN10_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN10_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN10_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN10_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN10_INT_TYPE_M  (RTCIO_GPIO_PIN10_INT_TYPE_V << RTCIO_GPIO_PIN10_INT_TYPE_S)
#define RTCIO_GPIO_PIN10_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN10_INT_TYPE_S  7

/* RTCIO_GPIO_PIN10_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN10_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN10_PAD_DRIVER_M  (RTCIO_GPIO_PIN10_PAD_DRIVER_V << RTCIO_GPIO_PIN10_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN10_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN10_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN11_REG register
 * RTC configuration for pin 11
 */

#define RTCIO_RTC_GPIO_PIN11_REG (DR_REG_RTCIO_BASE + 0x54)

/* RTCIO_GPIO_PIN11_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN11_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN11_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN11_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN11_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN11_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN11_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN11_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN11_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN11_INT_TYPE_M  (RTCIO_GPIO_PIN11_INT_TYPE_V << RTCIO_GPIO_PIN11_INT_TYPE_S)
#define RTCIO_GPIO_PIN11_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN11_INT_TYPE_S  7

/* RTCIO_GPIO_PIN11_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN11_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN11_PAD_DRIVER_M  (RTCIO_GPIO_PIN11_PAD_DRIVER_V << RTCIO_GPIO_PIN11_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN11_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN11_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN12_REG register
 * RTC configuration for pin 12
 */

#define RTCIO_RTC_GPIO_PIN12_REG (DR_REG_RTCIO_BASE + 0x58)

/* RTCIO_GPIO_PIN12_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN12_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN12_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN12_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN12_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN12_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN12_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN12_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN12_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN12_INT_TYPE_M  (RTCIO_GPIO_PIN12_INT_TYPE_V << RTCIO_GPIO_PIN12_INT_TYPE_S)
#define RTCIO_GPIO_PIN12_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN12_INT_TYPE_S  7

/* RTCIO_GPIO_PIN12_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN12_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN12_PAD_DRIVER_M  (RTCIO_GPIO_PIN12_PAD_DRIVER_V << RTCIO_GPIO_PIN12_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN12_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN12_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN13_REG register
 * RTC configuration for pin 13
 */

