apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
#define RTCIO_RTC_GPIO_PIN13_REG (DR_REG_RTCIO_BASE + 0x5c)

/* RTCIO_GPIO_PIN13_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN13_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN13_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN13_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN13_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN13_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN13_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN13_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN13_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN13_INT_TYPE_M  (RTCIO_GPIO_PIN13_INT_TYPE_V << RTCIO_GPIO_PIN13_INT_TYPE_S)
#define RTCIO_GPIO_PIN13_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN13_INT_TYPE_S  7

/* RTCIO_GPIO_PIN13_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN13_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN13_PAD_DRIVER_M  (RTCIO_GPIO_PIN13_PAD_DRIVER_V << RTCIO_GPIO_PIN13_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN13_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN13_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN14_REG register
 * RTC configuration for pin 14
 */

#define RTCIO_RTC_GPIO_PIN14_REG (DR_REG_RTCIO_BASE + 0x60)

/* RTCIO_GPIO_PIN14_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN14_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN14_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN14_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN14_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN14_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN14_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN14_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN14_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN14_INT_TYPE_M  (RTCIO_GPIO_PIN14_INT_TYPE_V << RTCIO_GPIO_PIN14_INT_TYPE_S)
#define RTCIO_GPIO_PIN14_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN14_INT_TYPE_S  7

/* RTCIO_GPIO_PIN14_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN14_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN14_PAD_DRIVER_M  (RTCIO_GPIO_PIN14_PAD_DRIVER_V << RTCIO_GPIO_PIN14_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN14_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN14_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN15_REG register
 * RTC configuration for pin 15
 */

#define RTCIO_RTC_GPIO_PIN15_REG (DR_REG_RTCIO_BASE + 0x64)

/* RTCIO_GPIO_PIN15_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN15_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN15_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN15_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN15_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN15_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN15_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN15_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN15_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN15_INT_TYPE_M  (RTCIO_GPIO_PIN15_INT_TYPE_V << RTCIO_GPIO_PIN15_INT_TYPE_S)
#define RTCIO_GPIO_PIN15_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN15_INT_TYPE_S  7

/* RTCIO_GPIO_PIN15_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN15_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN15_PAD_DRIVER_M  (RTCIO_GPIO_PIN15_PAD_DRIVER_V << RTCIO_GPIO_PIN15_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN15_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN15_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN16_REG register
 * RTC configuration for pin 16
 */

#define RTCIO_RTC_GPIO_PIN16_REG (DR_REG_RTCIO_BASE + 0x68)

/* RTCIO_GPIO_PIN16_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN16_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN16_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN16_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN16_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN16_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN16_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN16_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN16_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN16_INT_TYPE_M  (RTCIO_GPIO_PIN16_INT_TYPE_V << RTCIO_GPIO_PIN16_INT_TYPE_S)
#define RTCIO_GPIO_PIN16_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN16_INT_TYPE_S  7

/* RTCIO_GPIO_PIN16_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN16_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN16_PAD_DRIVER_M  (RTCIO_GPIO_PIN16_PAD_DRIVER_V << RTCIO_GPIO_PIN16_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN16_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN16_PAD_DRIVER_S  2

/* RTCIO_RTC_GPIO_PIN17_REG register
 * RTC configuration for pin 17
 */

#define RTCIO_RTC_GPIO_PIN17_REG (DR_REG_RTCIO_BASE + 0x6c)

/* RTCIO_GPIO_PIN17_WAKEUP_ENABLE : R/W; bitpos: [10]; default: 0;
 * GPIO wake-up enable. This will only wake up ESP32-S2 from Light-sleep.
 */

#define RTCIO_GPIO_PIN17_WAKEUP_ENABLE    (BIT(10))
#define RTCIO_GPIO_PIN17_WAKEUP_ENABLE_M  (RTCIO_GPIO_PIN17_WAKEUP_ENABLE_V << RTCIO_GPIO_PIN17_WAKEUP_ENABLE_S)
#define RTCIO_GPIO_PIN17_WAKEUP_ENABLE_V  0x00000001
#define RTCIO_GPIO_PIN17_WAKEUP_ENABLE_S  10

/* RTCIO_GPIO_PIN17_INT_TYPE : R/W; bitpos: [9:7]; default: 0;
 * GPIO interrupt type selection. 0: GPIO interrupt disabled; 1: rising edge
 * trigger; 2: falling edge trigger; 3: any edge trigger; 4: low level
 * trigger; 5: high level trigger.
 */

#define RTCIO_GPIO_PIN17_INT_TYPE    0x00000007
#define RTCIO_GPIO_PIN17_INT_TYPE_M  (RTCIO_GPIO_PIN17_INT_TYPE_V << RTCIO_GPIO_PIN17_INT_TYPE_S)
#define RTCIO_GPIO_PIN17_INT_TYPE_V  0x00000007
#define RTCIO_GPIO_PIN17_INT_TYPE_S  7

/* RTCIO_GPIO_PIN17_PAD_DRIVER : R/W; bitpos: [2]; default: 0;
 * Pad driver selection. 0: normal output; 1: open drain.
 */

#define RTCIO_GPIO_PIN17_PAD_DRIVER    (BIT(2))
#define RTCIO_GPIO_PIN17_PAD_DRIVER_M  (RTCIO_GPIO_PIN17_PAD_DRIVER_V << RTCIO_GPIO_PIN17_PAD_DRIVER_S)
#define RTCIO_GPIO_PIN17_PAD_DRIVER_V  0x00000001
#define RTCIO_GPIO_PIN17_PAD_DRIVER_S  2

