apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/* RTCIO_TOUCH_PAD1_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_TOUCH_PAD1_RUE    (BIT(27))
#define RTCIO_TOUCH_PAD1_RUE_M  (RTCIO_TOUCH_PAD1_RUE_V << RTCIO_TOUCH_PAD1_RUE_S)
#define RTCIO_TOUCH_PAD1_RUE_V  0x00000001
#define RTCIO_TOUCH_PAD1_RUE_S  27

/* RTCIO_TOUCH_PAD1_START : R/W; bitpos: [22]; default: 0;
 * Start touch sensor.
 */

#define RTCIO_TOUCH_PAD1_START    (BIT(22))
#define RTCIO_TOUCH_PAD1_START_M  (RTCIO_TOUCH_PAD1_START_V << RTCIO_TOUCH_PAD1_START_S)
#define RTCIO_TOUCH_PAD1_START_V  0x00000001
#define RTCIO_TOUCH_PAD1_START_S  22

/* RTCIO_TOUCH_PAD1_TIE_OPT : R/W; bitpos: [21]; default: 0;
 * The tie option of touch sensor. 0: tie low; 1: tie high.
 */

#define RTCIO_TOUCH_PAD1_TIE_OPT    (BIT(21))
#define RTCIO_TOUCH_PAD1_TIE_OPT_M  (RTCIO_TOUCH_PAD1_TIE_OPT_V << RTCIO_TOUCH_PAD1_TIE_OPT_S)
#define RTCIO_TOUCH_PAD1_TIE_OPT_V  0x00000001
#define RTCIO_TOUCH_PAD1_TIE_OPT_S  21

/* RTCIO_TOUCH_PAD1_XPD : R/W; bitpos: [20]; default: 0;
 * Touch sensor power on.
 */

#define RTCIO_TOUCH_PAD1_XPD    (BIT(20))
#define RTCIO_TOUCH_PAD1_XPD_M  (RTCIO_TOUCH_PAD1_XPD_V << RTCIO_TOUCH_PAD1_XPD_S)
#define RTCIO_TOUCH_PAD1_XPD_V  0x00000001
#define RTCIO_TOUCH_PAD1_XPD_S  20

/* RTCIO_TOUCH_PAD1_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * Connect the RTC pad input to digital pad input.  0 is available.
 */

#define RTCIO_TOUCH_PAD1_MUX_SEL    (BIT(19))
#define RTCIO_TOUCH_PAD1_MUX_SEL_M  (RTCIO_TOUCH_PAD1_MUX_SEL_V << RTCIO_TOUCH_PAD1_MUX_SEL_S)
#define RTCIO_TOUCH_PAD1_MUX_SEL_V  0x00000001
#define RTCIO_TOUCH_PAD1_MUX_SEL_S  19

/* RTCIO_TOUCH_PAD1_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_TOUCH_PAD1_FUN_SEL    0x00000003
#define RTCIO_TOUCH_PAD1_FUN_SEL_M  (RTCIO_TOUCH_PAD1_FUN_SEL_V << RTCIO_TOUCH_PAD1_FUN_SEL_S)
#define RTCIO_TOUCH_PAD1_FUN_SEL_V  0x00000003
#define RTCIO_TOUCH_PAD1_FUN_SEL_S  17

/* RTCIO_TOUCH_PAD1_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 0: no sleep mode; 1: enable sleep mode.
 */

#define RTCIO_TOUCH_PAD1_SLP_SEL    (BIT(16))
#define RTCIO_TOUCH_PAD1_SLP_SEL_M  (RTCIO_TOUCH_PAD1_SLP_SEL_V << RTCIO_TOUCH_PAD1_SLP_SEL_S)
#define RTCIO_TOUCH_PAD1_SLP_SEL_V  0x00000001
#define RTCIO_TOUCH_PAD1_SLP_SEL_S  16

/* RTCIO_TOUCH_PAD1_SLP_IE : R/W; bitpos: [15]; default: 0;
 * Input enable in sleep mode.
 */

#define RTCIO_TOUCH_PAD1_SLP_IE    (BIT(15))
#define RTCIO_TOUCH_PAD1_SLP_IE_M  (RTCIO_TOUCH_PAD1_SLP_IE_V << RTCIO_TOUCH_PAD1_SLP_IE_S)
#define RTCIO_TOUCH_PAD1_SLP_IE_V  0x00000001
#define RTCIO_TOUCH_PAD1_SLP_IE_S  15

/* RTCIO_TOUCH_PAD1_SLP_OE : R/W; bitpos: [14]; default: 0;
 * Output enable in sleep mode.
 */

#define RTCIO_TOUCH_PAD1_SLP_OE    (BIT(14))
#define RTCIO_TOUCH_PAD1_SLP_OE_M  (RTCIO_TOUCH_PAD1_SLP_OE_V << RTCIO_TOUCH_PAD1_SLP_OE_S)
#define RTCIO_TOUCH_PAD1_SLP_OE_V  0x00000001
#define RTCIO_TOUCH_PAD1_SLP_OE_S  14

/* RTCIO_TOUCH_PAD1_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_TOUCH_PAD1_FUN_IE    (BIT(13))
#define RTCIO_TOUCH_PAD1_FUN_IE_M  (RTCIO_TOUCH_PAD1_FUN_IE_V << RTCIO_TOUCH_PAD1_FUN_IE_S)
#define RTCIO_TOUCH_PAD1_FUN_IE_V  0x00000001
#define RTCIO_TOUCH_PAD1_FUN_IE_S  13

/* RTCIO_TOUCH_PAD2_REG register
 * Touch pad 2 configuration register
 */

#define RTCIO_TOUCH_PAD2_REG (DR_REG_RTCIO_BASE + 0x8c)

/* RTCIO_TOUCH_PAD2_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_TOUCH_PAD2_DRV    0x00000003
#define RTCIO_TOUCH_PAD2_DRV_M  (RTCIO_TOUCH_PAD2_DRV_V << RTCIO_TOUCH_PAD2_DRV_S)
#define RTCIO_TOUCH_PAD2_DRV_V  0x00000003
#define RTCIO_TOUCH_PAD2_DRV_S  29

/* RTCIO_TOUCH_PAD2_RDE : R/W; bitpos: [28]; default: 1;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_TOUCH_PAD2_RDE    (BIT(28))
#define RTCIO_TOUCH_PAD2_RDE_M  (RTCIO_TOUCH_PAD2_RDE_V << RTCIO_TOUCH_PAD2_RDE_S)
#define RTCIO_TOUCH_PAD2_RDE_V  0x00000001
#define RTCIO_TOUCH_PAD2_RDE_S  28

/* RTCIO_TOUCH_PAD2_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_TOUCH_PAD2_RUE    (BIT(27))
#define RTCIO_TOUCH_PAD2_RUE_M  (RTCIO_TOUCH_PAD2_RUE_V << RTCIO_TOUCH_PAD2_RUE_S)
#define RTCIO_TOUCH_PAD2_RUE_V  0x00000001
#define RTCIO_TOUCH_PAD2_RUE_S  27

/* RTCIO_TOUCH_PAD2_START : R/W; bitpos: [22]; default: 0;
 * Start touch sensor.
 */

#define RTCIO_TOUCH_PAD2_START    (BIT(22))
#define RTCIO_TOUCH_PAD2_START_M  (RTCIO_TOUCH_PAD2_START_V << RTCIO_TOUCH_PAD2_START_S)
#define RTCIO_TOUCH_PAD2_START_V  0x00000001
#define RTCIO_TOUCH_PAD2_START_S  22

/* RTCIO_TOUCH_PAD2_TIE_OPT : R/W; bitpos: [21]; default: 0;
 * The tie option of touch sensor. 0: tie low; 1: tie high.
 */

#define RTCIO_TOUCH_PAD2_TIE_OPT    (BIT(21))
#define RTCIO_TOUCH_PAD2_TIE_OPT_M  (RTCIO_TOUCH_PAD2_TIE_OPT_V << RTCIO_TOUCH_PAD2_TIE_OPT_S)
#define RTCIO_TOUCH_PAD2_TIE_OPT_V  0x00000001
#define RTCIO_TOUCH_PAD2_TIE_OPT_S  21

/* RTCIO_TOUCH_PAD2_XPD : R/W; bitpos: [20]; default: 0;
 * Touch sensor power on.
 */

#define RTCIO_TOUCH_PAD2_XPD    (BIT(20))
#define RTCIO_TOUCH_PAD2_XPD_M  (RTCIO_TOUCH_PAD2_XPD_V << RTCIO_TOUCH_PAD2_XPD_S)
#define RTCIO_TOUCH_PAD2_XPD_V  0x00000001
#define RTCIO_TOUCH_PAD2_XPD_S  20

/* RTCIO_TOUCH_PAD2_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * Connect the RTC pad input to digital pad input.  0 is available.
 */

#define RTCIO_TOUCH_PAD2_MUX_SEL    (BIT(19))
#define RTCIO_TOUCH_PAD2_MUX_SEL_M  (RTCIO_TOUCH_PAD2_MUX_SEL_V << RTCIO_TOUCH_PAD2_MUX_SEL_S)
#define RTCIO_TOUCH_PAD2_MUX_SEL_V  0x00000001
#define RTCIO_TOUCH_PAD2_MUX_SEL_S  19

/* RTCIO_TOUCH_PAD2_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_TOUCH_PAD2_FUN_SEL    0x00000003
#define RTCIO_TOUCH_PAD2_FUN_SEL_M  (RTCIO_TOUCH_PAD2_FUN_SEL_V << RTCIO_TOUCH_PAD2_FUN_SEL_S)
#define RTCIO_TOUCH_PAD2_FUN_SEL_V  0x00000003
#define RTCIO_TOUCH_PAD2_FUN_SEL_S  17

/* RTCIO_TOUCH_PAD2_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 0: no sleep mode; 1: enable sleep mode.
 */

#define RTCIO_TOUCH_PAD2_SLP_SEL    (BIT(16))
#define RTCIO_TOUCH_PAD2_SLP_SEL_M  (RTCIO_TOUCH_PAD2_SLP_SEL_V << RTCIO_TOUCH_PAD2_SLP_SEL_S)
#define RTCIO_TOUCH_PAD2_SLP_SEL_V  0x00000001
#define RTCIO_TOUCH_PAD2_SLP_SEL_S  16

/* RTCIO_TOUCH_PAD2_SLP_IE : R/W; bitpos: [15]; default: 0;
 * Input enable in sleep mode.
 */

