apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/* RTCIO_TOUCH_PAD14_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_TOUCH_PAD14_FUN_SEL    0x00000003
#define RTCIO_TOUCH_PAD14_FUN_SEL_M  (RTCIO_TOUCH_PAD14_FUN_SEL_V << RTCIO_TOUCH_PAD14_FUN_SEL_S)
#define RTCIO_TOUCH_PAD14_FUN_SEL_V  0x00000003
#define RTCIO_TOUCH_PAD14_FUN_SEL_S  17

/* RTCIO_TOUCH_PAD14_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 0: no sleep mode; 1: enable sleep mode.
 */

#define RTCIO_TOUCH_PAD14_SLP_SEL    (BIT(16))
#define RTCIO_TOUCH_PAD14_SLP_SEL_M  (RTCIO_TOUCH_PAD14_SLP_SEL_V << RTCIO_TOUCH_PAD14_SLP_SEL_S)
#define RTCIO_TOUCH_PAD14_SLP_SEL_V  0x00000001
#define RTCIO_TOUCH_PAD14_SLP_SEL_S  16

/* RTCIO_TOUCH_PAD14_SLP_IE : R/W; bitpos: [15]; default: 0;
 * Input enable in sleep mode.
 */

#define RTCIO_TOUCH_PAD14_SLP_IE    (BIT(15))
#define RTCIO_TOUCH_PAD14_SLP_IE_M  (RTCIO_TOUCH_PAD14_SLP_IE_V << RTCIO_TOUCH_PAD14_SLP_IE_S)
#define RTCIO_TOUCH_PAD14_SLP_IE_V  0x00000001
#define RTCIO_TOUCH_PAD14_SLP_IE_S  15

/* RTCIO_TOUCH_PAD14_SLP_OE : R/W; bitpos: [14]; default: 0;
 * Output enable in sleep mode.
 */

#define RTCIO_TOUCH_PAD14_SLP_OE    (BIT(14))
#define RTCIO_TOUCH_PAD14_SLP_OE_M  (RTCIO_TOUCH_PAD14_SLP_OE_V << RTCIO_TOUCH_PAD14_SLP_OE_S)
#define RTCIO_TOUCH_PAD14_SLP_OE_V  0x00000001
#define RTCIO_TOUCH_PAD14_SLP_OE_S  14

/* RTCIO_TOUCH_PAD14_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_TOUCH_PAD14_FUN_IE    (BIT(13))
#define RTCIO_TOUCH_PAD14_FUN_IE_M  (RTCIO_TOUCH_PAD14_FUN_IE_V << RTCIO_TOUCH_PAD14_FUN_IE_S)
#define RTCIO_TOUCH_PAD14_FUN_IE_V  0x00000001
#define RTCIO_TOUCH_PAD14_FUN_IE_S  13

/* RTCIO_XTAL_32P_PAD_REG register
 * 32KHz crystal P-pad configuration register
 */

#define RTCIO_XTAL_32P_PAD_REG (DR_REG_RTCIO_BASE + 0xc0)

/* RTCIO_X32P_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_X32P_DRV    0x00000003
#define RTCIO_X32P_DRV_M  (RTCIO_X32P_DRV_V << RTCIO_X32P_DRV_S)
#define RTCIO_X32P_DRV_V  0x00000003
#define RTCIO_X32P_DRV_S  29

/* RTCIO_X32P_RDE : R/W; bitpos: [28]; default: 0;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_X32P_RDE    (BIT(28))
#define RTCIO_X32P_RDE_M  (RTCIO_X32P_RDE_V << RTCIO_X32P_RDE_S)
#define RTCIO_X32P_RDE_V  0x00000001
#define RTCIO_X32P_RDE_S  28

/* RTCIO_X32P_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_X32P_RUE    (BIT(27))
#define RTCIO_X32P_RUE_M  (RTCIO_X32P_RUE_V << RTCIO_X32P_RUE_S)
#define RTCIO_X32P_RUE_V  0x00000001
#define RTCIO_X32P_RUE_S  27

/* RTCIO_X32P_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO,0: use digital GPIO
 */

#define RTCIO_X32P_MUX_SEL    (BIT(19))
#define RTCIO_X32P_MUX_SEL_M  (RTCIO_X32P_MUX_SEL_V << RTCIO_X32P_MUX_SEL_S)
#define RTCIO_X32P_MUX_SEL_V  0x00000001
#define RTCIO_X32P_MUX_SEL_S  19

/* RTCIO_X32P_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_X32P_FUN_SEL    0x00000003
#define RTCIO_X32P_FUN_SEL_M  (RTCIO_X32P_FUN_SEL_V << RTCIO_X32P_FUN_SEL_S)
#define RTCIO_X32P_FUN_SEL_V  0x00000003
#define RTCIO_X32P_FUN_SEL_S  17

/* RTCIO_X32P_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

#define RTCIO_X32P_SLP_SEL    (BIT(16))
#define RTCIO_X32P_SLP_SEL_M  (RTCIO_X32P_SLP_SEL_V << RTCIO_X32P_SLP_SEL_S)
#define RTCIO_X32P_SLP_SEL_V  0x00000001
#define RTCIO_X32P_SLP_SEL_S  16

/* RTCIO_X32P_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_X32P_SLP_IE    (BIT(15))
#define RTCIO_X32P_SLP_IE_M  (RTCIO_X32P_SLP_IE_V << RTCIO_X32P_SLP_IE_S)
#define RTCIO_X32P_SLP_IE_V  0x00000001
#define RTCIO_X32P_SLP_IE_S  15

/* RTCIO_X32P_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_X32P_SLP_OE    (BIT(14))
#define RTCIO_X32P_SLP_OE_M  (RTCIO_X32P_SLP_OE_V << RTCIO_X32P_SLP_OE_S)
#define RTCIO_X32P_SLP_OE_V  0x00000001
#define RTCIO_X32P_SLP_OE_S  14

/* RTCIO_X32P_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_X32P_FUN_IE    (BIT(13))
#define RTCIO_X32P_FUN_IE_M  (RTCIO_X32P_FUN_IE_V << RTCIO_X32P_FUN_IE_S)
#define RTCIO_X32P_FUN_IE_V  0x00000001
#define RTCIO_X32P_FUN_IE_S  13

/* RTCIO_XTAL_32N_PAD_REG register
 * 32KHz crystal N-pad configuration register
 */

#define RTCIO_XTAL_32N_PAD_REG (DR_REG_RTCIO_BASE + 0xc4)

/* RTCIO_X32N_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_X32N_DRV    0x00000003
#define RTCIO_X32N_DRV_M  (RTCIO_X32N_DRV_V << RTCIO_X32N_DRV_S)
#define RTCIO_X32N_DRV_V  0x00000003
#define RTCIO_X32N_DRV_S  29

/* RTCIO_X32N_RDE : R/W; bitpos: [28]; default: 0;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_X32N_RDE    (BIT(28))
#define RTCIO_X32N_RDE_M  (RTCIO_X32N_RDE_V << RTCIO_X32N_RDE_S)
#define RTCIO_X32N_RDE_V  0x00000001
#define RTCIO_X32N_RDE_S  28

/* RTCIO_X32N_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_X32N_RUE    (BIT(27))
#define RTCIO_X32N_RUE_M  (RTCIO_X32N_RUE_V << RTCIO_X32N_RUE_S)
#define RTCIO_X32N_RUE_V  0x00000001
#define RTCIO_X32N_RUE_S  27

/* RTCIO_X32N_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO,0: use digital GPIO
 */

#define RTCIO_X32N_MUX_SEL    (BIT(19))
#define RTCIO_X32N_MUX_SEL_M  (RTCIO_X32N_MUX_SEL_V << RTCIO_X32N_MUX_SEL_S)
#define RTCIO_X32N_MUX_SEL_V  0x00000001
#define RTCIO_X32N_MUX_SEL_S  19

/* RTCIO_X32N_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_X32N_FUN_SEL    0x00000003
#define RTCIO_X32N_FUN_SEL_M  (RTCIO_X32N_FUN_SEL_V << RTCIO_X32N_FUN_SEL_S)
#define RTCIO_X32N_FUN_SEL_V  0x00000003
#define RTCIO_X32N_FUN_SEL_S  17

/* RTCIO_X32N_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

