apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
#define RTCIO_X32N_SLP_SEL    (BIT(16))
#define RTCIO_X32N_SLP_SEL_M  (RTCIO_X32N_SLP_SEL_V << RTCIO_X32N_SLP_SEL_S)
#define RTCIO_X32N_SLP_SEL_V  0x00000001
#define RTCIO_X32N_SLP_SEL_S  16

/* RTCIO_X32N_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_X32N_SLP_IE    (BIT(15))
#define RTCIO_X32N_SLP_IE_M  (RTCIO_X32N_SLP_IE_V << RTCIO_X32N_SLP_IE_S)
#define RTCIO_X32N_SLP_IE_V  0x00000001
#define RTCIO_X32N_SLP_IE_S  15

/* RTCIO_X32N_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_X32N_SLP_OE    (BIT(14))
#define RTCIO_X32N_SLP_OE_M  (RTCIO_X32N_SLP_OE_V << RTCIO_X32N_SLP_OE_S)
#define RTCIO_X32N_SLP_OE_V  0x00000001
#define RTCIO_X32N_SLP_OE_S  14

/* RTCIO_X32N_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_X32N_FUN_IE    (BIT(13))
#define RTCIO_X32N_FUN_IE_M  (RTCIO_X32N_FUN_IE_V << RTCIO_X32N_FUN_IE_S)
#define RTCIO_X32N_FUN_IE_V  0x00000001
#define RTCIO_X32N_FUN_IE_S  13

/* RTCIO_PAD_DAC1_REG register
 * DAC1 configuration register
 */

#define RTCIO_PAD_DAC1_REG (DR_REG_RTCIO_BASE + 0xc8)

/* RTCIO_PDAC1_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_PDAC1_DRV    0x00000003
#define RTCIO_PDAC1_DRV_M  (RTCIO_PDAC1_DRV_V << RTCIO_PDAC1_DRV_S)
#define RTCIO_PDAC1_DRV_V  0x00000003
#define RTCIO_PDAC1_DRV_S  29

/* RTCIO_PDAC1_RDE : R/W; bitpos: [28]; default: 0;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_PDAC1_RDE    (BIT(28))
#define RTCIO_PDAC1_RDE_M  (RTCIO_PDAC1_RDE_V << RTCIO_PDAC1_RDE_S)
#define RTCIO_PDAC1_RDE_V  0x00000001
#define RTCIO_PDAC1_RDE_S  28

/* RTCIO_PDAC1_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_PDAC1_RUE    (BIT(27))
#define RTCIO_PDAC1_RUE_M  (RTCIO_PDAC1_RUE_V << RTCIO_PDAC1_RUE_S)
#define RTCIO_PDAC1_RUE_V  0x00000001
#define RTCIO_PDAC1_RUE_S  27

/* RTCIO_PDAC1_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO, 0: use digital GPIO
 */

#define RTCIO_PDAC1_MUX_SEL    (BIT(19))
#define RTCIO_PDAC1_MUX_SEL_M  (RTCIO_PDAC1_MUX_SEL_V << RTCIO_PDAC1_MUX_SEL_S)
#define RTCIO_PDAC1_MUX_SEL_V  0x00000001
#define RTCIO_PDAC1_MUX_SEL_S  19

/* RTCIO_PDAC1_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * DAC_1 function selection.
 */

#define RTCIO_PDAC1_FUN_SEL    0x00000003
#define RTCIO_PDAC1_FUN_SEL_M  (RTCIO_PDAC1_FUN_SEL_V << RTCIO_PDAC1_FUN_SEL_S)
#define RTCIO_PDAC1_FUN_SEL_V  0x00000003
#define RTCIO_PDAC1_FUN_SEL_S  17

/* RTCIO_PDAC1_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

#define RTCIO_PDAC1_SLP_SEL    (BIT(16))
#define RTCIO_PDAC1_SLP_SEL_M  (RTCIO_PDAC1_SLP_SEL_V << RTCIO_PDAC1_SLP_SEL_S)
#define RTCIO_PDAC1_SLP_SEL_V  0x00000001
#define RTCIO_PDAC1_SLP_SEL_S  16

/* RTCIO_PDAC1_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_PDAC1_SLP_IE    (BIT(15))
#define RTCIO_PDAC1_SLP_IE_M  (RTCIO_PDAC1_SLP_IE_V << RTCIO_PDAC1_SLP_IE_S)
#define RTCIO_PDAC1_SLP_IE_V  0x00000001
#define RTCIO_PDAC1_SLP_IE_S  15

/* RTCIO_PDAC1_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_PDAC1_SLP_OE    (BIT(14))
#define RTCIO_PDAC1_SLP_OE_M  (RTCIO_PDAC1_SLP_OE_V << RTCIO_PDAC1_SLP_OE_S)
#define RTCIO_PDAC1_SLP_OE_V  0x00000001
#define RTCIO_PDAC1_SLP_OE_S  14

/* RTCIO_PDAC1_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_PDAC1_FUN_IE    (BIT(13))
#define RTCIO_PDAC1_FUN_IE_M  (RTCIO_PDAC1_FUN_IE_V << RTCIO_PDAC1_FUN_IE_S)
#define RTCIO_PDAC1_FUN_IE_V  0x00000001
#define RTCIO_PDAC1_FUN_IE_S  13

/* RTCIO_PDAC1_DAC_XPD_FORCE : R/W; bitpos: [12]; default: 0;
 * 1: use RTCIO_PDAC1_XPD_DAC to control DAC_1 output; 0: use SAR ADC FSM to
 * control DAC_1 output.
 */

#define RTCIO_PDAC1_DAC_XPD_FORCE    (BIT(12))
#define RTCIO_PDAC1_DAC_XPD_FORCE_M  (RTCIO_PDAC1_DAC_XPD_FORCE_V << RTCIO_PDAC1_DAC_XPD_FORCE_S)
#define RTCIO_PDAC1_DAC_XPD_FORCE_V  0x00000001
#define RTCIO_PDAC1_DAC_XPD_FORCE_S  12

/* RTCIO_PDAC1_XPD_DAC : R/W; bitpos: [11]; default: 0;
 * When RTCIO_PDAC1_DAC_XPD_FORCE is set to 1, 1: enable DAC_1 output; 0:
 * disable DAC_1 output.
 */

#define RTCIO_PDAC1_XPD_DAC    (BIT(11))
#define RTCIO_PDAC1_XPD_DAC_M  (RTCIO_PDAC1_XPD_DAC_V << RTCIO_PDAC1_XPD_DAC_S)
#define RTCIO_PDAC1_XPD_DAC_V  0x00000001
#define RTCIO_PDAC1_XPD_DAC_S  11

/* RTCIO_PDAC1_DAC : R/W; bitpos: [10:3]; default: 0;
 * Configure DAC_1 output when RTCIO_PDAC1_DAC_XPD_FORCE is set to 1.
 */

#define RTCIO_PDAC1_DAC    0x000000FF
#define RTCIO_PDAC1_DAC_M  (RTCIO_PDAC1_DAC_V << RTCIO_PDAC1_DAC_S)
#define RTCIO_PDAC1_DAC_V  0x000000FF
#define RTCIO_PDAC1_DAC_S  3

/* RTCIO_PAD_DAC2_REG register
 * DAC2 configuration register
 */

#define RTCIO_PAD_DAC2_REG (DR_REG_RTCIO_BASE + 0xcc)

/* RTCIO_PDAC2_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_PDAC2_DRV    0x00000003
#define RTCIO_PDAC2_DRV_M  (RTCIO_PDAC2_DRV_V << RTCIO_PDAC2_DRV_S)
#define RTCIO_PDAC2_DRV_V  0x00000003
#define RTCIO_PDAC2_DRV_S  29

/* RTCIO_PDAC2_RDE : R/W; bitpos: [28]; default: 0;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_PDAC2_RDE    (BIT(28))
#define RTCIO_PDAC2_RDE_M  (RTCIO_PDAC2_RDE_V << RTCIO_PDAC2_RDE_S)
#define RTCIO_PDAC2_RDE_V  0x00000001
#define RTCIO_PDAC2_RDE_S  28

/* RTCIO_PDAC2_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_PDAC2_RUE    (BIT(27))
#define RTCIO_PDAC2_RUE_M  (RTCIO_PDAC2_RUE_V << RTCIO_PDAC2_RUE_S)
#define RTCIO_PDAC2_RUE_V  0x00000001
#define RTCIO_PDAC2_RUE_S  27

/* RTCIO_PDAC2_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO, 0: use digital GPIO
 */

#define RTCIO_PDAC2_MUX_SEL    (BIT(19))
#define RTCIO_PDAC2_MUX_SEL_M  (RTCIO_PDAC2_MUX_SEL_V << RTCIO_PDAC2_MUX_SEL_S)
#define RTCIO_PDAC2_MUX_SEL_V  0x00000001
#define RTCIO_PDAC2_MUX_SEL_S  19

/* RTCIO_PDAC2_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * DAC_2 function selection.
 */

#define RTCIO_PDAC2_FUN_SEL    0x00000003
#define RTCIO_PDAC2_FUN_SEL_M  (RTCIO_PDAC2_FUN_SEL_V << RTCIO_PDAC2_FUN_SEL_S)
#define RTCIO_PDAC2_FUN_SEL_V  0x00000003
#define RTCIO_PDAC2_FUN_SEL_S  17

