apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
/* RTCIO_RTC_PAD20_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_RTC_PAD20_RUE    (BIT(27))
#define RTCIO_RTC_PAD20_RUE_M  (RTCIO_RTC_PAD20_RUE_V << RTCIO_RTC_PAD20_RUE_S)
#define RTCIO_RTC_PAD20_RUE_V  0x00000001
#define RTCIO_RTC_PAD20_RUE_S  27

/* RTCIO_RTC_PAD20_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO, 0: use digital GPIO
 */

#define RTCIO_RTC_PAD20_MUX_SEL    (BIT(19))
#define RTCIO_RTC_PAD20_MUX_SEL_M  (RTCIO_RTC_PAD20_MUX_SEL_V << RTCIO_RTC_PAD20_MUX_SEL_S)
#define RTCIO_RTC_PAD20_MUX_SEL_V  0x00000001
#define RTCIO_RTC_PAD20_MUX_SEL_S  19

/* RTCIO_RTC_PAD20_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_RTC_PAD20_FUN_SEL    0x00000003
#define RTCIO_RTC_PAD20_FUN_SEL_M  (RTCIO_RTC_PAD20_FUN_SEL_V << RTCIO_RTC_PAD20_FUN_SEL_S)
#define RTCIO_RTC_PAD20_FUN_SEL_V  0x00000003
#define RTCIO_RTC_PAD20_FUN_SEL_S  17

/* RTCIO_RTC_PAD20_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

#define RTCIO_RTC_PAD20_SLP_SEL    (BIT(16))
#define RTCIO_RTC_PAD20_SLP_SEL_M  (RTCIO_RTC_PAD20_SLP_SEL_V << RTCIO_RTC_PAD20_SLP_SEL_S)
#define RTCIO_RTC_PAD20_SLP_SEL_V  0x00000001
#define RTCIO_RTC_PAD20_SLP_SEL_S  16

/* RTCIO_RTC_PAD20_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_RTC_PAD20_SLP_IE    (BIT(15))
#define RTCIO_RTC_PAD20_SLP_IE_M  (RTCIO_RTC_PAD20_SLP_IE_V << RTCIO_RTC_PAD20_SLP_IE_S)
#define RTCIO_RTC_PAD20_SLP_IE_V  0x00000001
#define RTCIO_RTC_PAD20_SLP_IE_S  15

/* RTCIO_RTC_PAD20_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_RTC_PAD20_SLP_OE    (BIT(14))
#define RTCIO_RTC_PAD20_SLP_OE_M  (RTCIO_RTC_PAD20_SLP_OE_V << RTCIO_RTC_PAD20_SLP_OE_S)
#define RTCIO_RTC_PAD20_SLP_OE_V  0x00000001
#define RTCIO_RTC_PAD20_SLP_OE_S  14

/* RTCIO_RTC_PAD20_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_RTC_PAD20_FUN_IE    (BIT(13))
#define RTCIO_RTC_PAD20_FUN_IE_M  (RTCIO_RTC_PAD20_FUN_IE_V << RTCIO_RTC_PAD20_FUN_IE_S)
#define RTCIO_RTC_PAD20_FUN_IE_V  0x00000001
#define RTCIO_RTC_PAD20_FUN_IE_S  13

/* RTCIO_RTC_PAD21_REG register
 * Touch pad 21 configuration register
 */

#define RTCIO_RTC_PAD21_REG (DR_REG_RTCIO_BASE + 0xd8)

/* RTCIO_RTC_PAD21_DRV : R/W; bitpos: [30:29]; default: 2;
 * Select the drive strength of the pad. 0: ~5 mA: 1: ~10 mA: 2: ~20 mA; 3:
 * ~40 mA.
 */

#define RTCIO_RTC_PAD21_DRV    0x00000003
#define RTCIO_RTC_PAD21_DRV_M  (RTCIO_RTC_PAD21_DRV_V << RTCIO_RTC_PAD21_DRV_S)
#define RTCIO_RTC_PAD21_DRV_V  0x00000003
#define RTCIO_RTC_PAD21_DRV_S  29

/* RTCIO_RTC_PAD21_RDE : R/W; bitpos: [28]; default: 1;
 * Pull-up enable of the pad. 1: internal pull-up enabled; 0: internal
 * pull-up disabled.
 */

#define RTCIO_RTC_PAD21_RDE    (BIT(28))
#define RTCIO_RTC_PAD21_RDE_M  (RTCIO_RTC_PAD21_RDE_V << RTCIO_RTC_PAD21_RDE_S)
#define RTCIO_RTC_PAD21_RDE_V  0x00000001
#define RTCIO_RTC_PAD21_RDE_S  28

/* RTCIO_RTC_PAD21_RUE : R/W; bitpos: [27]; default: 0;
 * Pull-down enable of the pad. 1: internal pull-down enabled, 0: internal
 * pull-down disabled.
 */

#define RTCIO_RTC_PAD21_RUE    (BIT(27))
#define RTCIO_RTC_PAD21_RUE_M  (RTCIO_RTC_PAD21_RUE_V << RTCIO_RTC_PAD21_RUE_S)
#define RTCIO_RTC_PAD21_RUE_V  0x00000001
#define RTCIO_RTC_PAD21_RUE_S  27

/* RTCIO_RTC_PAD21_MUX_SEL : R/W; bitpos: [19]; default: 0;
 * 1: use RTC GPIO, 0: use digital GPIO
 */

#define RTCIO_RTC_PAD21_MUX_SEL    (BIT(19))
#define RTCIO_RTC_PAD21_MUX_SEL_M  (RTCIO_RTC_PAD21_MUX_SEL_V << RTCIO_RTC_PAD21_MUX_SEL_S)
#define RTCIO_RTC_PAD21_MUX_SEL_V  0x00000001
#define RTCIO_RTC_PAD21_MUX_SEL_S  19

/* RTCIO_RTC_PAD21_FUN_SEL : R/W; bitpos: [18:17]; default: 0;
 * Function selection.
 */

#define RTCIO_RTC_PAD21_FUN_SEL    0x00000003
#define RTCIO_RTC_PAD21_FUN_SEL_M  (RTCIO_RTC_PAD21_FUN_SEL_V << RTCIO_RTC_PAD21_FUN_SEL_S)
#define RTCIO_RTC_PAD21_FUN_SEL_V  0x00000003
#define RTCIO_RTC_PAD21_FUN_SEL_S  17

/* RTCIO_RTC_PAD21_SLP_SEL : R/W; bitpos: [16]; default: 0;
 * 1: enable sleep mode, 0: no sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_SEL    (BIT(16))
#define RTCIO_RTC_PAD21_SLP_SEL_M  (RTCIO_RTC_PAD21_SLP_SEL_V << RTCIO_RTC_PAD21_SLP_SEL_S)
#define RTCIO_RTC_PAD21_SLP_SEL_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_SEL_S  16

/* RTCIO_RTC_PAD21_SLP_IE : R/W; bitpos: [15]; default: 0;
 * input enable in sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_IE    (BIT(15))
#define RTCIO_RTC_PAD21_SLP_IE_M  (RTCIO_RTC_PAD21_SLP_IE_V << RTCIO_RTC_PAD21_SLP_IE_S)
#define RTCIO_RTC_PAD21_SLP_IE_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_IE_S  15

/* RTCIO_RTC_PAD21_SLP_OE : R/W; bitpos: [14]; default: 0;
 * output enable in sleep mode
 */

#define RTCIO_RTC_PAD21_SLP_OE    (BIT(14))
#define RTCIO_RTC_PAD21_SLP_OE_M  (RTCIO_RTC_PAD21_SLP_OE_V << RTCIO_RTC_PAD21_SLP_OE_S)
#define RTCIO_RTC_PAD21_SLP_OE_V  0x00000001
#define RTCIO_RTC_PAD21_SLP_OE_S  14

/* RTCIO_RTC_PAD21_FUN_IE : R/W; bitpos: [13]; default: 0;
 * Input enable in normal execution.
 */

#define RTCIO_RTC_PAD21_FUN_IE    (BIT(13))
#define RTCIO_RTC_PAD21_FUN_IE_M  (RTCIO_RTC_PAD21_FUN_IE_V << RTCIO_RTC_PAD21_FUN_IE_S)
#define RTCIO_RTC_PAD21_FUN_IE_V  0x00000001
#define RTCIO_RTC_PAD21_FUN_IE_S  13

/* RTCIO_EXT_WAKEUP0_REG register
 * External wake up configuration register
 */

#define RTCIO_EXT_WAKEUP0_REG (DR_REG_RTCIO_BASE + 0xdc)

/* RTCIO_EXT_WAKEUP0_SEL : R/W; bitpos: [31:27]; default: 0;
 * GPIO[0-17] can be used to wake up the chip when the chip is in the sleep
 * mode. This register prompts the pad source to wake up the chip when the
 * latter is indeep/light sleep mode.
 * 0: select GPIO0; 1: select GPIO2, etc
 */

#define RTCIO_EXT_WAKEUP0_SEL    0x0000001F
#define RTCIO_EXT_WAKEUP0_SEL_M  (RTCIO_EXT_WAKEUP0_SEL_V << RTCIO_EXT_WAKEUP0_SEL_S)
#define RTCIO_EXT_WAKEUP0_SEL_V  0x0000001F
#define RTCIO_EXT_WAKEUP0_SEL_S  27

/* RTCIO_XTL_EXT_CTR_REG register
 * Crystal power down enable GPIO source
 */

#define RTCIO_XTL_EXT_CTR_REG (DR_REG_RTCIO_BASE + 0xe0)

/* RTCIO_XTL_EXT_CTR_SEL : R/W; bitpos: [31:27]; default: 0;
 * Select the external crystal power down enable source to get into sleep
 * mode. 0: select GPIO0; 1: select GPIO1, etc. The input value on this pin
 * XOR RTC_CNTL_EXT_XTL_CONF_REG[30] is the crystal power down enable signal.
 */

#define RTCIO_XTL_EXT_CTR_SEL    0x0000001F
#define RTCIO_XTL_EXT_CTR_SEL_M  (RTCIO_XTL_EXT_CTR_SEL_V << RTCIO_XTL_EXT_CTR_SEL_S)
#define RTCIO_XTL_EXT_CTR_SEL_V  0x0000001F
#define RTCIO_XTL_EXT_CTR_SEL_S  27

/* RTCIO_SAR_I2C_IO_REG register
 * RTC I²C pad selection
 */

#define RTCIO_SAR_I2C_IO_REG (DR_REG_RTCIO_BASE + 0xe4)

/* RTCIO_SAR_I2C_SDA_SEL : R/W; bitpos: [31:30]; default: 0;
 * Selects a pad the RTC I2C SDA signal connects to. 0: use TOUCH PAD1; 1:
 * use TOUCH PAD3.
 */

