apache/nuttx/arch/xtensa/src/esp32s3/hardware/esp32s3_rtc_io.h
#define RTCIO_SAR_I2C_SDA_SEL    0x00000003
#define RTCIO_SAR_I2C_SDA_SEL_M  (RTCIO_SAR_I2C_SDA_SEL_V << RTCIO_SAR_I2C_SDA_SEL_S)
#define RTCIO_SAR_I2C_SDA_SEL_V  0x00000003
#define RTCIO_SAR_I2C_SDA_SEL_S  30

/* RTCIO_SAR_I2C_SCL_SEL : R/W; bitpos: [29:28]; default: 0;
 * Selects a pad the RTC I2C SCL signal connects to. 0: use TOUCH PAD0; 1:
 * use TOUCH PAD2.
 */

#define RTCIO_SAR_I2C_SCL_SEL    0x00000003
#define RTCIO_SAR_I2C_SCL_SEL_M  (RTCIO_SAR_I2C_SCL_SEL_V << RTCIO_SAR_I2C_SCL_SEL_S)
#define RTCIO_SAR_I2C_SCL_SEL_V  0x00000003
#define RTCIO_SAR_I2C_SCL_SEL_S  28

/* RTCIO_SAR_DEBUG_BIT_SEL : R/W; bitpos: [27:23]; default: 0; */

#define RTCIO_SAR_DEBUG_BIT_SEL    0x0000001F
#define RTCIO_SAR_DEBUG_BIT_SEL_M  (RTCIO_SAR_DEBUG_BIT_SEL_V << RTCIO_SAR_DEBUG_BIT_SEL_S)
#define RTCIO_SAR_DEBUG_BIT_SEL_V  0x0000001F
#define RTCIO_SAR_DEBUG_BIT_SEL_S  23

/* RTCIO_RTC_IO_TOUCH_CTRL_REG register
 * Touch Control register
 */

#define RTCIO_RTC_IO_TOUCH_CTRL_REG (DR_REG_RTCIO_BASE + 0xe8)

/* RTCIO_IO_TOUCH_BUFMODE : R/W; bitpos: [4]; default: 0; */

#define RTCIO_IO_TOUCH_BUFMODE    (BIT(4))
#define RTCIO_IO_TOUCH_BUFMODE_M  (RTCIO_IO_TOUCH_BUFMODE_V << RTCIO_IO_TOUCH_BUFMODE_S)
#define RTCIO_IO_TOUCH_BUFMODE_V  0x00000001
#define RTCIO_IO_TOUCH_BUFMODE_S  4

/* RTCIO_IO_TOUCH_BUFSEL : R/W; bitpos: [3:0]; default: 0; */

#define RTCIO_IO_TOUCH_BUFSEL    0x0000000F
#define RTCIO_IO_TOUCH_BUFSEL_M  (RTCIO_IO_TOUCH_BUFSEL_V << RTCIO_IO_TOUCH_BUFSEL_S)
#define RTCIO_IO_TOUCH_BUFSEL_V  0x0000000F
#define RTCIO_IO_TOUCH_BUFSEL_S  0

/* RTCIO_RTC_IO_DATE_REG register
 * Version control register
 */

#define RTCIO_RTC_IO_DATE_REG (DR_REG_RTCIO_BASE + 0x1fc)

/* RTCIO_IO_DATE : R/W; bitpos: [27:0]; default: 28'h2101180;
 * Version control register
 */

#define RTCIO_IO_DATE    0x0FFFFFFF
#define RTCIO_IO_DATE_M  (RTCIO_IO_DATE_V << RTCIO_IO_DATE_S)
#define RTCIO_IO_DATE_V  0x0FFFFFFF
#define RTCIO_IO_DATE_S  0

#endif /* __ARCH_XTENSA_SRC_ESP32S3_HARDWARE_ESP32S3_RTC_IO_H */
